/*
   Copyright (c) by Valery Goryachev (Wal)
*/


#include <X11/Xutil.h>

#include "swl.h"
#include "swl_wincore_internal.h"
#include <sys/times.h>
#include <unistd.h>
#include <string.h>
#include <locale.h>

#ifdef USEFREETYPE
#include <ft2build.h>
#include FT_FREETYPE_H
#endif

#if defined( __APPLE__ )
const unsigned int MetaMask = 0x0010;
#endif

namespace wal
{

	Win* GetWinByID( WinID hWnd );
	int DelWinFromHash( WinID w );
	unsigned RunTimers();
	void AddWinToHash( WinID handle, Win* w );
	void AppBlock( WinID w );
	void AppUnblock( WinID w );

//static
	Display*     display = 0;
//static
	XVisualInfo visualInfo;
	static int     screen = 0;
	static Colormap      colorMap;
	static Visual*     visual;
	static XIM     inputMethod = 0;
	static XIC     inputContext = 0; //???

	static Atom       atom_WM_PROTOCOLS;
	static Atom       atom_WM_DELETE_WINDOW = 0; //Атом, чтоб window manager не закрывал окна самостоятельно

//WinID     Win::focusWinId =0;
	static WinID      activeWinId = 0;

//static SCImage winIcon;
	static Pixmap winIconPixmap = None;
	static Pixmap winIconMask = None;

	static unsigned toNone( unsigned n );
//static
	unsigned ( *CreateColor )( unsigned ) = toNone; //toRGB24;//toNone;
	static int connectionId = -1;
	static unsigned whiteColor = 0xFFFFFF, blackColor = 0;

	inline unsigned CreateColorFromRGB( unsigned c ) { return CreateColor( c ); }

///////////////////////
	clock_t CPS = 1;
	static void TimeInit()
	{
		CPS = sysconf( _SC_CLK_TCK );

		if ( CPS <= 0 ) { CPS = 1; }
	}

// ????????????????????????????
	unsigned GetTickMiliseconds()
	{
		struct tms t;
		clock_t ct = times( &t );
		return ( ct * 1000 ) / CPS;
	}



////////////  FreeType inc /////////////////////
#include "swl_wincore_freetype_inc.h"


///// { Clipboard data

	static ClipboardText clipboardText;
	static Atom atom_PRIMARY = 0;
	static Atom atom_CLIPBOARD = 0;
	static Atom atom_TARGETS = 0;
	static Atom atom_STRING = 0;
	static Atom atom_UTF8 = 0;
	static Atom atom_COMPOUND = 0;
	static Atom atom_CDEST = 0;
	static Atom atom_INCR = 0;

	static Window clipboardWinId = 0;

	static void X11_Clipbopard_Init()
	{
		atom_PRIMARY = XInternAtom( display, "PRIMARY", False );
		atom_CLIPBOARD = XInternAtom( display, "CLIPBOARD", False );

		atom_STRING = XInternAtom( display, "STRING", True );
		atom_UTF8 = XInternAtom( display, "UTF8_STRING", False );
		atom_TARGETS = XInternAtom( display, "TARGETS", False );
		atom_COMPOUND = XInternAtom( display, "COMPOUND_TEXT", False );
		atom_CDEST = XInternAtom( display, "SWL_CLIPDEST", False );
		atom_INCR = XInternAtom( display, "INCR", False );

		XSetWindowAttributes attrs;

		attrs.event_mask =  PropertyChangeMask;

		unsigned long valueMask = CWEventMask;

		valueMask |= CWOverrideRedirect;
		attrs.override_redirect = True;

		clipboardWinId = XCreateWindow(
		                    display,
		                    DefaultRootWindow( display ),
		                    0, 0, 10, 10,
		                    0,
		                    CopyFromParent,
		                    InputOutput,
		                    visual,
		                    valueMask, &attrs );
	}

	void ClipboardSetText( Win* w, ClipboardText& text )
	{
		clipboardText = text;
		XSetSelectionOwner( display, atom_PRIMARY, clipboardWinId, CurrentTime );
		XSetSelectionOwner( display, atom_CLIPBOARD, clipboardWinId, CurrentTime );
	}


	void ClipboardClear()
	{
		clipboardText.Clear();
		XSetSelectionOwner( display, atom_PRIMARY, None, CurrentTime );
		XSetSelectionOwner( display, atom_CLIPBOARD, None, CurrentTime );
	}



///// } (Clipboard data)



///////////////////////////////////   Init


//////////////////////////////// PseudoColor

#define CBCOUNT (16*16*16)
	static int stColors[CBCOUNT];

	inline int AbsInt( int a ) { return a < 0 ? -a : a; }

	struct RgbColorStruct
	{
		int r, g, b;
		RgbColorStruct(): r( 0 ), g( 0 ), b( 0 ) {}
		RgbColorStruct( unsigned bgr ): r( bgr & 0xFF ), g( ( bgr >> 8 ) & 0xFF ), b( ( bgr >> 16 ) & 0xFF ) {}
		void operator = ( unsigned bgr ) { r = ( bgr & 0xFF ); g = ( bgr >> 8 ) & 0xFF; b = ( bgr >> 16 ) & 0xFF; }
		unsigned long Dist2( RgbColorStruct& a )
		{
			unsigned long dr = AbsInt( r - a.r );
			unsigned long dg = AbsInt( g - a.g );
			unsigned long db = AbsInt( b - a.b );
			return dr * dr + dg * dg + db * db;
		}
	};

	struct TempStruct
	{
		RgbColorStruct rgb;
		int lastCNum;
		unsigned long lastDist2;
		TempStruct(): lastCNum( 0 ), lastDist2( 0xFFFFFFFF ) {}
	};

	static void MakeStColors( unsigned* col, int count )
	{
		TempStruct ts[CBCOUNT];

		int i;

		for ( int r = 0; r < 16; r++ )
			for ( int g = 0; g < 16; g++ )
				for ( int b = 0; b < 16; b++ )
				{
					int n = b * 256 + g * 16 + r;
					ts[n].rgb.r = ( r << 4 );
					ts[n].rgb.g = ( g << 4 );
					ts[n].rgb.b = ( b << 4 );
				}


		for ( i = 0; i < count; i++ )
		{
			RgbColorStruct rgb( col[i] );

			for ( int j = 0; j < CBCOUNT; j++ )
			{
				unsigned long d2 = rgb.Dist2( ts[j].rgb );

				if ( ts[j].lastDist2 > d2 )
				{
					ts[j].lastDist2 = d2;
					ts[j].lastCNum = i;
				}
			}
		}

		for ( i = 0; i < CBCOUNT; i++ ) { stColors[i] = ts[i].lastCNum; }
	}

	static unsigned CreatePseudoColor( unsigned bgr )
	{
		return stColors[ ( ( bgr >> 4 ) & 0xF ) + ( ( bgr >> 8 ) & 0xF0 ) + ( ( bgr >> 12 ) & 0xF00 ) ];
	}

	static void InitPseudoColor()
	{
		int n = visualInfo.colormap_size;

		if ( n > 4096 ) { n = 4096; }

		XColor xc[4096];
		unsigned bgr[4096];
		int i;

		for ( i = 0; i < n; i++ ) { xc[i].pixel = i; }

		XQueryColors( display, colorMap, xc, n );

		if ( visualInfo.c_class == PseudoColor || visualInfo.c_class == GrayScale )
		{
			//зафиксировать бля все цвета в палитре по умолчанию
			for ( i = 0; i < n; i++ )
			{
				int ret = XAllocColor( display, colorMap, &( xc[i] ) );
			}

		}

		int count = 0;

		for ( i = 0; i < n; i++ )
			if ( xc[i].flags & ( DoRed | DoBlue | DoGreen ) )
			{
				unsigned c = 0;

				if ( xc[i].flags & DoRed )
				{
					c |= ( ( xc[i].red >> 8 ) & 0xFF );
				}

				if ( xc[i].flags & DoGreen )
				{
					c |= ( ( xc[i].green >> 8 ) & 0xFF ) << 8;
				}

				if ( xc[i].flags & DoBlue )
				{
					c |= ( ( xc[i].blue >> 8 ) & 0xFF ) << 16;
				}

				bgr[count++] = c;
			}


		MakeStColors( bgr, count );
		CreateColor = CreatePseudoColor;
	}


//////////////////////////////// TrueColor

	static unsigned toRGB24( unsigned n ) { return ( ( n << 16 ) & 0xFF0000 ) | ( n & 0xFF00 ) | ( ( n >> 16 ) & 0xFF ); }
	static unsigned toNone( unsigned n ) { return n; }
	static int red_rs, red_ls;
	static int blue_rs, blue_ls;
	static int green_rs, green_ls;

	static unsigned toTrueColor( unsigned n )
	{
		return   ( ( ( n & 0x0000FF ) >> red_rs  ) << red_ls  ) |
		         ( ( ( n & 0x00FF00 ) >> green_rs ) << green_ls ) |
		         ( ( ( n & 0xFF0000 ) >> blue_rs ) << blue_ls );
	}

	static int CalcColorShifts( unsigned long mask, int* sh )
	{
		int i;

		for ( i = 0; i < int( sizeof( mask ) * 8 ) && ( mask & 1 ) == 0; i++, mask >>= 1 ) { EMPTY_OPER; }

		*sh = ( ( mask & 1 ) ? i : 0 );

		for ( i = 0; i < int( sizeof( mask ) * 8 ) && ( mask & 1 ); i++, mask >>= 1 ) { EMPTY_OPER; }

		return ( ( mask & 1 ) == 0 ) ? i : 0;
	}

	void InitTrueColor() //called if visual class is TrueColor
	{
		if (  visualInfo.red_mask == 0xFF0000 &&
		      visualInfo.green_mask == 0x00FF00 &&
		      visualInfo.blue_mask == 0x0000FF )
		{
			CreateColor = toRGB24;
		}
		else if (  visualInfo.red_mask == 0x0000FF &&
		           visualInfo.green_mask == 0x00FF00 &&
		           visualInfo.blue_mask == 0xFF0000 )
		{
			CreateColor = toNone;
		}
		else
		{
			int sh, d;
			d = CalcColorShifts( visualInfo.red_mask, &sh );
			red_rs = ( 8 - d ) + 0;
			red_ls = sh;
			d = CalcColorShifts( visualInfo.blue_mask, &sh );
			blue_rs = ( 8 - d ) + 16;
			blue_ls = sh;
			d = CalcColorShifts( visualInfo.green_mask, &sh );
			green_rs = ( 8 - d ) + 8;
			green_ls = sh;

			if ( red_rs < 0 ) { red_ls += -red_rs; red_rs = 0; }

			CreateColor = toTrueColor;
			//dbg_printf("(%i,%i) (%i,%i) (%i,%i) \n", red_rs, red_ls, blue_rs, blue_ls, green_rs, green_ls);

		}
	}


	static int xErrorCount = 0;
	static char xErrorLastText[0x100];

	static int ErrorHandler( Display* d, XErrorEvent* e )
	{

		XGetErrorText( d, e->error_code, xErrorLastText, sizeof( xErrorLastText ) );

		printf( "XError: %s\n", xErrorLastText );
		xErrorCount++;
		return 0;
	}


	void AppInit()
	{
		TimeInit();
		display = XOpenDisplay( 0 );

		if ( !display )
		{
			throw_msg( "can`t open X display (XOpenDisplay)" );
		}

		screen  = DefaultScreen( display );
		visual  = DefaultVisual( display, screen );
		colorMap   = DefaultColormap( display, screen );

		int nv = 0;
		XVisualInfo* vi = XGetVisualInfo( display, 0, &visualInfo, &nv );

		if ( !nv || !vi )
		{
			throw_msg( "no VisualInfo list" );
		}

		int i;

		for ( i = 0; i < nv; i++ )
			if ( vi[i].visual == visual )
			{
				break;
			}

		if ( i >= nv )
		{
			throw_msg( "default VisualInfo not found" );
		}

		visualInfo = vi[i];
		XFree( vi );

		connectionId = XConnectionNumber( display );
		whiteColor = WhitePixel( display, screen );
		blackColor = BlackPixel( display, screen );

		switch ( visualInfo.c_class )
		{
			case TrueColor:
				InitTrueColor();
				break;

			case GrayScale:      //!!!
			case StaticGray: ;      //!!!

			case StaticColor:
			case PseudoColor:
				InitPseudoColor();
				break;


			case DirectColor:
				throw_msg( "DirectColor visual class is not supported" );

			default:
				throw_msg( "Unknown visual class" );
		}

		setlocale( LC_ALL, "" );
		inputMethod = XOpenIM( display, 0, 0, 0 );

		if ( inputMethod )
		{
			XSetLocaleModifiers( "@im=local" );
			inputContext = XCreateIC( inputMethod, XNInputStyle, XIMPreeditNothing | XIMStatusNothing, XNClientWindow, DefaultRootWindow( display ),
			                          NULL ); //для борьбы с "missing sentinel in function call" надо написать NULL а не 0 (вот уроды)

			//0 );
			if ( !inputContext )
			{
				fprintf( stderr, "Can`t create input context (X)\n" );
			}

			if ( !XSupportsLocale() )
			{
				fprintf( stderr, "Locale not supported by X\n" );
			}
		}

		XSetErrorHandler( ErrorHandler );
		//Atoms
		atom_WM_DELETE_WINDOW = XInternAtom( display, "WM_DELETE_WINDOW", True );
		atom_WM_PROTOCOLS = XInternAtom( display, "WM_PROTOCOLS", True );


		X11_Clipbopard_Init();

		BaseInit();
	}

	struct RepaintHashNode
	{
		WINID id;
		RepaintHashNode ( WinID h ): id( h ) {}
		const WINID& key() const { return id; };
	private:
		RepaintHashNode (): id( 0 ) {}
	};

	void DrawExposeRect( Win* w )
	{
		if ( !w ) { return; }

		if ( !w->exposeRect.IsEmpty() )
		{
			GC gc( w );
			w->Paint( gc, w->exposeRect );
			w->exposeRect.Zero();
		}
	}


	static chash<RepaintHashNode, WINID> repaintHash;
	static void ForeachDrawExpose( RepaintHashNode* t, void* data )
	{
		DrawExposeRect( GetWinByID( t->id ) );
	}

	static void PostRepaint()
	{
		repaintHash.foreach( ForeachDrawExpose, 0 );
		repaintHash.clear();
	}

	static void AddRepaint( Win* w )
	{
		if ( !w ) { return; }

		RepaintHashNode node( w->GetID() );
		repaintHash.put( node );
	}

	static void MovePopups( Win* w, int xDelta, int yDelta )
	{
		if ( !w ) { return; }

		int n = w->ChildCount();

		for ( int i = 0; i < n; i++ )
		{
			Win* c = w->GetChild( i );

			if ( c->Type() == Win::WT_POPUP )
			{
				crect r = c->ScreenRect();
				r.left  += xDelta;
				r.right += xDelta;
				r.top += yDelta;
				r.bottom += yDelta;
				c->Move( r );
			}
			else if ( c->Type() != Win::WT_MAIN )
			{
				MovePopups( c, xDelta, yDelta );
			}
		}
	}


	static bool ChildKeyRecursive( Win* parent, Win* child, cevent_key* ev )
	{
		if ( !parent ) { return false; }

		if ( parent->Type() != Win::WT_MAIN && ChildKeyRecursive( parent->Parent(), child, ev ) ) { return true; }

		return parent->IsEnabled() && parent->EventChildKey( child, ev );
	}



	static void DoKeyEvent( int type, Win* w, KeySym ks, unsigned km,  unicode_t ch )
	{
//	printf( "type = %i ks = %x km = %u, ch = %u\n", type, (unsigned int)ks, km, ch );

		switch ( ks )
		{
			case XK_a:
				ks = XK_A;
				break;

			case XK_b:
				ks = XK_B;
				break;

			case XK_c:
				ks = XK_C;
				break;

			case XK_d:
				ks = XK_D;
				break;

			case XK_e:
				ks = XK_E;
				break;

			case XK_f:
				ks = XK_F;
				break;

			case XK_g:
				ks = XK_G;
				break;

			case XK_h:
				ks = XK_H;
				break;

			case XK_i:
				ks = XK_I;
				break;

			case XK_j:
				ks = XK_J;
				break;

			case XK_k:
				ks = XK_K;
				break;

			case XK_l:
				ks = XK_L;
				break;

			case XK_m:
				ks = XK_M;
				break;

			case XK_n:
				ks = XK_N;
				break;

			case XK_o:
				ks = XK_O;
				break;

			case XK_p:
				ks = XK_P;
				break;

			case XK_q:
				ks = XK_Q;
				break;

			case XK_r:
				ks = XK_R;
				break;

			case XK_s:
				ks = XK_S;
				break;

			case XK_t:
				ks = XK_T;
				break;

			case XK_u:
				ks = XK_U;
				break;

			case XK_v:
				ks = XK_V;
				break;

			case XK_w:
				ks = XK_W;
				break;

			case XK_x:
				ks = XK_X;
				break;

			case XK_y:
				ks = XK_Y;
				break;

			case XK_z:
				ks = XK_Z;
				break;
		}


		cevent_key ev( type, ks , km, 1, ch );

		if ( w->Type() != Win::WT_MAIN && ChildKeyRecursive( w->Parent(), w, &ev ) )
		{
			return;
		}

		if ( !w->IsEnabled() ) { return; }

		w->EventKey( &ev );
	}

	void KeyEvent( int type, XKeyEvent* event )
	{
		Win* w = GetWinByID( Win::focusWinId );

		if ( !w ) { return; }

		if ( w->Blocked() ) { return; }

		unsigned state = event->state;

		unsigned km = 0;
#if defined( __APPLE__ )
		if ( state & MetaMask ) { km |= KM_CTRL; }
#endif
		if ( state & ShiftMask ) { km |= KM_SHIFT; }

		if ( state & ControlMask ) { km |= KM_CTRL; }

		if ( state & Mod1Mask ) { km |= KM_ALT; }

		KeySym ks = 0;

		if ( inputMethod )
		{

			static wchar_t* buf = 0;
			static int bufLen = 0;

			if ( bufLen == 0 )
			{
				buf = ( wchar_t* ) malloc( 0x100 * sizeof( wchar_t ) );

				if ( buf ) { bufLen = 0x100; }
				else
				{
					fprintf( stderr, "out of memory\n" );
					exit( 1 );
				}
			}

			Status ret;
			int n = 0;

			while ( true )
			{
				n = XwcLookupString( inputContext, event, buf, 0x100, &ks, &ret );

				if ( ret != XBufferOverflow ) { break; }

				wchar_t* p = ( wchar_t* )malloc( bufLen * 2 * sizeof( wchar_t ) );

				if ( !p ) { return; }

				free( buf );
				buf = p;
				bufLen *= 2;
			}

			if ( ret !=  XLookupNone )
			{
				if ( n > 0 )
				{
					for ( int i = 0; i < n; i++ )
					{
						DoKeyEvent( type, w, ks, km, buf[i] );
					}
				}
				else
				{
					DoKeyEvent( type, w, ks, km, 0 );
				}

				return;
			}
		}


		char buf[256] = "";
		int n = XLookupString( event, buf, sizeof( buf ), &ks, NULL );

		if ( n > 0 )
		{
			for ( int i = 0; i < n; i++ )
			{
				DoKeyEvent( type, w, ks, km, buf[i] );
			}
		}
		else
		{
			DoKeyEvent( type, w, ks, km, 0 );
		}
	}

	inline int Distance( int a, int b )
	{
		return a > b ? a - b : b - a;
	}


	static void _ClipboardRequest( XEvent* event );

	int DoEvents( XEvent* event ) //return count of windows
	{
		dbg_printf( "e(%i) ", event->type );
		fflush( stdout );

		switch ( event->type )
		{

			case KeyPress:
				KeyEvent( EV_KEYDOWN, ( XKeyEvent* )event );
				break; //   2

			case KeyRelease:
				KeyEvent( EV_KEYUP, ( XKeyEvent* ) event );
				break; //   3

			case ButtonPress: //4
			case ButtonRelease:
				// 5
			{
				Win* w = GetWinByID( event->xany.window );

				if ( !w ) { break; }

				XButtonEvent* e = &event->xbutton;

				int type = ( ( event->type == ButtonPress ) ? EV_MOUSE_PRESS : EV_MOUSE_RELEASE );

				if ( !w->IsEnabled() ) { break; }

				if ( w->Blocked() ) { break; }

				int xPos = e->x;
				int yPos = e->y;

				unsigned km = 0;
				unsigned state = event->xbutton.state;
#if defined( __APPLE__ )
				if ( state & MetaMask ) { km |= KM_CTRL; }
#endif
				if ( state & ShiftMask ) { km |= KM_SHIFT; }

				if ( state & ControlMask ) { km |= KM_CTRL; }

				if ( state & Mod1Mask ) { km |= KM_ALT; }

				unsigned bf = 0;

//			printf( "Button = %i\n", e->button );

				unsigned button = 0;

				switch ( e->button )
				{
					case Button1:
						button = MB_L;
						break;

					case Button2:
						button = MB_M;
						break;

					case Button3:
						button = MB_R;
						break;

					case Button4:
						button = MB_X1;
						break;

					case Button5:
						button = MB_X2;
						break;
				}

				// mouse wheel up
				if ( e->button == Button4 && event->type == ButtonPress )
				{
					DoKeyEvent( EV_KEYDOWN, w, VK_UP, 0, 0 );
					DoKeyEvent( EV_KEYUP,   w, VK_UP, 0, 0 );
					break;
				}

				// mouse wheel down
				if ( e->button == Button5 && event->type == ButtonPress )
				{

					DoKeyEvent( EV_KEYDOWN, w, VK_DOWN, 0, 0 );
					DoKeyEvent( EV_KEYUP, w, VK_DOWN, 0, 0 );
					break;
				}

				if ( button == MB_L && event->type == ButtonPress )
				{
					static Time lastLeftClick = 0;
					static int lastX = 0, lastY = 0;
					static const Time doubleTime = 500;
					static const int maxXDistance = 5, maxYDistance = 5; //максимальное изменение координат при двойном нажатии

					if ( event->xbutton.time - lastLeftClick <= doubleTime &&
					     Distance( lastX, event->xbutton.x_root ) <= maxXDistance &&
					     Distance( lastY, event->xbutton.y_root ) <= maxYDistance )
					{
						type = EV_MOUSE_DOUBLE;
						lastLeftClick = 0;
					}
					else
					{
						lastLeftClick = event->xbutton.time;
						lastX = event->xbutton.x_root;
						lastY = event->xbutton.y_root;
					}
				}


				cevent_mouse evm( type, cpoint( xPos, yPos ), button, bf, km );


				w->Event( &evm );
			}
			break;

			case MotionNotify:
			{

				Win* w = GetWinByID( event->xany.window );

				if ( !w ) { break; }

				XMotionEvent* e = &event->xmotion;

				if ( !w->IsEnabled() ) { break; }

				if ( w->Blocked() ) { break; }

				cevent_mouse ev( EV_MOUSE_MOVE, cpoint( e->x, e->y ), 0, 0, 0 );
				w->Event( &ev );

			}

			break; //   6

			case EnterNotify:
			{
				Win* w = GetWinByID( event->xany.window );

				if ( !w ) { break; }

				cevent ev( EV_ENTER );
				w->Event( &ev );
				//dbg_printf("EnterNotify\n");
			}
			break; //   7

			case LeaveNotify:
			{
				Win* w = GetWinByID( event->xany.window );

				if ( !w ) { break; }

				cevent evl( EV_LEAVE );
				w->Event( &evl );
			}
			break; //   8


			case FocusIn:
			{
				if (  event->xfocus.detail == NotifyVirtual ||
				      event->xfocus.detail == NotifyNonlinearVirtual ||
				      event->xfocus.detail == NotifyPointer )
				{
					break;
				}

				Window id = event->xany.window;
				Win* w = GetWinByID( id );

				for ( ; w && w->type != Win::WT_MAIN && w->type != Win::WT_POPUP; w = w->parent )
				{
					EMPTY_OPER;
				}

				if ( w && w->handle != id )
				{
					id = w->handle;
				}

				if ( activeWinId == id )
				{
					break;
				}


				if ( Win::focusWinId )
				{
					Win* prevFocus = GetWinByID( Win::focusWinId );
					Win::focusWinId = 0;

					if ( prevFocus )
					{
						Win* w = prevFocus;

						for ( ; w && w->parent && w->type != Win::WT_MAIN && w->type != Win::WT_POPUP; w = w->parent )
						{
							w->parent->lastFocusChild = w->handle;
						}

						cevent ekf( EV_KILLFOCUS );
						prevFocus->Event( &ekf );

					}
				}

				Win* prevActive = GetWinByID( activeWinId );

				if ( activeWinId )
				{
					activeWinId = 0;

					if ( prevActive )
					{
						cevent_activate ev( false, w );
						activeWinId = 0;
						prevActive->Event( &ev );
					}
				}

				if ( !w ) { break; }

				if ( w->blockedBy )
				{
					Win* t = GetWinByID( w->blockedBy );

					if ( t )
					{
						if ( t->Type() == Win::WT_CHILD )
						{
							t->SetFocus();
						}
						else
						{
							t->Activate();
						}
					}

					break;
				}

				cevent_activate ev( true, prevActive );
				activeWinId = id;
				w->Event( &ev );
				Win::focusWinId = id;
				cevent ecf( EV_SETFOCUS );
				w->Event( &ecf );
			}

			break; //   9

			case FocusOut:
			{
				if (  event->xfocus.detail == NotifyVirtual ||
				      event->xfocus.detail == NotifyNonlinearVirtual ||
				      event->xfocus.detail == NotifyPointer )
				{
					break;
				}


				if ( activeWinId == event->xany.window )
				{
					Win* w = GetWinByID( activeWinId );
					activeWinId = 0;

					if ( !w ) { break; }

					if ( Win::focusWinId )
					{
						Win* t = GetWinByID( Win::focusWinId );
						Win::focusWinId = 0;

						if ( t )
						{
							Win* w = t;

							for ( ; w && w->parent && w->type != Win::WT_MAIN && w->type != Win::WT_POPUP; w = w->parent )
							{
								w->parent->lastFocusChild = w->handle;
							}

							cevent eKF( EV_KILLFOCUS );
							t->Event( &eKF );
						}
					}

					Window focus_return;
					int revert_to_return;
					XGetInputFocus( display, &focus_return, &revert_to_return );
					cevent_activate ev0( false, GetWinByID( focus_return ) );
					w->Event( &ev0 );
				}

			}

			break; //10

			case KeymapNotify:
				break; //   11

			case Expose:
			{
				Win* w = GetWinByID( event->xexpose.window );

				if ( !w ) { break; }

				crect r( event->xexpose.x, event->xexpose.y,
				         event->xexpose.x + event->xexpose.width, event->xexpose.y + event->xexpose.height );
				w->AddExposeRect( r );

				if ( !event->xexpose.count )
				{
					AddRepaint( w );
				}
			}
			break; //12

			case GraphicsExpose:
				break; //13

			case NoExpose:
				break; //14

			case VisibilityNotify:
				break; //15

			case CreateNotify:
				break; //16

			case DestroyNotify:
				break; //17

			case UnmapNotify:
			{
				Win* w = GetWinByID( event->xmap.window );

				if ( w )
				{
					cevent_show evShowFalse( false );
					w->Event( &evShowFalse );
				}

			}
			break; //18

			case MapNotify:
			{
				Win* w = GetWinByID( event->xmap.window );

				if ( w && ( w->Type() == Win::WT_MAIN || w->Type() == Win::WT_POPUP ) &&  w->showType == Win::SHOW_ACTIVE )
				{
					w->Activate();
				}

				if ( w )
				{
					cevent_show evShowTrue( true );
					w->Event( &evShowTrue );
				}

			}
			break; //19

			case MapRequest:
				dbg_printf( "MapRequest\n" );
				break; //20

			case ReparentNotify:
			{
				Win* w = GetWinByID( event->xreparent.window );

				if ( w ) { w->reparent = event->xreparent.parent; }
			}

			break; //   21

			case ConfigureNotify:
			{
				Win* w = GetWinByID( event->xconfigure.window );

				if ( !w ) { break; }

				bool resized = //true;
				   ( w->position.Width() != event->xconfigure.width ||
				     w->position.Height() != event->xconfigure.height );

				bool moved =
				   ( w->position.left != event->xconfigure.x ||
				     w->position.top != event->xconfigure.y );


				int xDelta = event->xconfigure.x - w->position.left;
				int yDelta = event->xconfigure.y - w->position.top;

				w->position.Set(
				   event->xconfigure.x,
				   event->xconfigure.y,
				   event->xconfigure.x + event->xconfigure.width,
				   event->xconfigure.y + event->xconfigure.height
				);

				if ( resized )
				{
					cevent_size evSize( cpoint ( event->xconfigure.width, event->xconfigure.height ) );
					w->Event( &evSize );
				}

				if ( moved )
				{
					cevent_move evMove( cpoint ( event->xconfigure.x, event->xconfigure.y ) );
					w->Event( &evMove );
				}

				if ( w->Type() != Win::WT_CHILD )
				{
					MovePopups( w, xDelta, yDelta );
				}

				dbg_printf( "ConfigureNotify above(%x)\n", event->xconfigure.above );
			}
			break; //   22

			case ConfigureRequest:
				break; //23

			case GravityNotify:
				break; //   24

			case ResizeRequest:
				break; //   25

			case CirculateNotify:
				break; //   26

			case CirculateRequest:
				break; //27

			case PropertyNotify:
				break; //   28

			case SelectionClear:
				break; //   29

			case SelectionRequest:

				_ClipboardRequest( event );

				break; //30

			case SelectionNotify:
				break; //   31

			case ColormapNotify:
				break; //   32

			case ClientMessage:
			{
				Win* w = GetWinByID( event->xclient.window );

				if ( w && event->xclient.message_type == atom_WM_PROTOCOLS && event->xclient.data.l[0] == atom_WM_DELETE_WINDOW )
				{
					cevent ev( EV_CLOSE );
					w->Event( &ev );
				}
			}
			break; //   33

			case MappingNotify:
				XRefreshKeyboardMapping( &( event->xmapping ) );
				dbg_printf( "MappingNotify\n" );
				break; //   34

				/*
				   case GenericEvent:
				      dbg_printf("GenericEvent\n");
				      break; //   35
				*/
			case LASTEvent:
				dbg_printf( "LASTEvent\n" );
				break; //36

			default:
				dbg_printf( "Event being thrown away\n" );
				break;
		}

		return 1; ///!!! need correction
	}

	static bool appExit = false;

	void AppExit() { appExit = true; }

	int AppRun()
	{
		appExit = false;

		while ( true )
		{
			wth_DoEvents();

			if ( appExit ) { return 0; }

			while ( XEventsQueued( display, QueuedAfterFlush ) > 0 )
			{
				XEvent event;
				XNextEvent( display, &event );
				wth_DoEvents();

				if ( !DoEvents( &event ) ) { return 0; }

				if ( appExit ) { return 0; }
			}

			unsigned w = RunTimers();
			PostRepaint();

			if ( XEventsQueued( display, QueuedAfterFlush ) > 0 )
			{
				continue;
			}

			fd_set fds;
			FD_ZERO( &fds );
			FD_SET( connectionId, &fds );
			int tSignalFd = wthInternalEvent.SignalFD();
			FD_SET( tSignalFd, &fds );

			struct timeval tv;
			tv.tv_sec = w / 1000;
			tv.tv_usec = ( w % 1000 ) * 1000;

			int n = connectionId > tSignalFd ? connectionId : tSignalFd;

			select( n + 1, &fds,  0, 0, &tv );
